//ইফি তে সাথে সাথেই ফাংশনকে কল করা হয়, এতে একটা ফিচার আছে, যদি আমরা সেই ফাংশন এর ভিতরের ডাটা বাহির থেকে আক্সেস করাতে না চাই, সেগুলো প্রাইভেট রাখতে চাই, তাহলে এই ইফি তা প্রদান করে। যদি বাহির থেকে এক্সেস করতে যাই, তাহলে এরর দেখাবে।

(function iifeFunc(){
    var msg="Hello Word";
    console.log(msg);
})();
// এখানে সাথে সাথে Hello world দেখাবে। কিন্তু নিচে এখন কল করলে এরর আসবে। 

iifeFunc(); //error show


//তবে es6 আসার কারনে এখন এটার পরিবর্তে let const ব্যবহার করেও প্রাইভেসি মেন্টেইন করা যায়। কারন let const ব্লক স্কোপ মেন্টেইন করে।



console.log(xx);