//let const es6 এর ফিচার। এগুলো দিয়ে ভ্যারিবল ডিক্লার করা হয়। এখন থেকে let const ই ব্যবহার করবো। let & var অনেকটা সেইম। এদের দিয়ে কোনো ভ্যারিয়েবল ডিক্লার করলেও, পরে মান চেঞ্জ করা যায়। কিন্তু const এ তা হয় না।
var x=5;
x=4;

let y=1;
y=2;

const z=7;
/* z=9;//এটা এরর শো করবে। */




//var দিয়ে ডিক্লার  করা ভ্যারিবল আবারো ডিক্লার করা গেলেও let and const দিয়ে তা যাবে না।
var n1=11;
var n1=12;

/* //এরর শো করবে।
let n2=22;
let n2=23;

//এরর শো করবে।
const n3=33;
const n3=34; */



//var ফাংশন স্কোপ মেনটেইন করে কিন্তু let const ব্লক স্কোপ মেন্টেন করে, তাই কোনো ভ্যারিয়েবল {} এর ভিতর var দিয়ে ডিক্লার করলে, সেটা বাহির থেকেও এক্সেস করা যায়। কিন্তু let const করলে যেত না।

function varCheck(){
    if(true){
        var x1=55;
    }
    console.log(x1);
}
varCheck();


//error show. y কে এক্সেস করা যাচ্ছে না ইফ এর বাহির থেকে। সেম কাজ const এর মধ্যেও হবে।
function letCheck(){
    if(true){
        let y1=55;
    }
    console.log(y1);
}
letCheck();